app/controllers/movies_controller.rb

  def similar_movies
    movie = Movie.find params[:id]
    @director=movie.director
    @movies= Movie.find_all_by_director(@director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'